src/Reports/ОтчетПоВыполнениюПланаЛинеекСводныйПоДатам/ОтчетПоВыполнениюПланаЛинеекСводныйПоДатам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыполнениюПланаЛинеекСводныйПоДатам</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУсловногоКоэффициента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ОтставаниеОтПланаПроизводства/ОтставаниеОтПланаПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтставаниеОтПланаПроизводства</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоУсл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПаспортЛинейки/ПаспортЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортЛинейки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВремяТактаМаксимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаМинимальное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяТактаРасчётное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыпускЗаДеньРасчётный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ТехническийЛидер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПростойЛинейки/ПростойЛинейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПростойЛинейки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Остановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ПричиныОстановок</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПроизводственногоКалендаря</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоВыполнениюПланаЛинеекСводныйПоДатам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Отчет.ВидУсловногоКоэффициента = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.Период.ДатаНачала = Результат;
	Отчет.Период.ДатаОкончания = КонецМесяца(Результат);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьОтставаниеПоЛинейкам(НаДату)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтставаниеОтПланаПроизводстваСрезПоследних.Количество,
	|	ОтставаниеОтПланаПроизводстваСрезПоследних.КоличествоУсл
	|ИЗ
	|	РегистрСведений.ОтставаниеОтПланаПроизводства.СрезПоследних(&НаДату, ) КАК ОтставаниеОтПланаПроизводстваСрезПоследних
	|ГДЕ
	|	ОтставаниеОтПланаПроизводстваСрезПоследних.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
Запрос.УстановитьПараметр("НаДату", НаДату);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
КоличествоУсл = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ВыборкаДетальныеЗаписи.Количество;
	КоличествоУсл = КоличествоУсл + ВыборкаДетальныеЗаписи.КоличествоУсл;
	КонецЦикла;
Возврат(Новый Структура("Количество,КоличествоУсл",Количество,КоличествоУсл));
КонецФункции 

&НаСервере
Функция ПолучитьВыпускЗаДеньРасчётныйПоЛинейкам(НаДату)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПаспортЛинейкиСрезПоследних.ВыпускЗаДеньРасчётный
	|ИЗ
	|	РегистрСведений.ПаспортЛинейки.СрезПоследних(&НаДату, ) КАК ПаспортЛинейкиСрезПоследних
	|ГДЕ
	|	ПаспортЛинейкиСрезПоследних.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
Запрос.УстановитьПараметр("НаДату", НаДату);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
ВыпускЗаДеньРасчётный = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ВыпускЗаДеньРасчётный = ВыпускЗаДеньРасчётный + ВыборкаДетальныеЗаписи.ВыпускЗаДеньРасчётный;
	КонецЦикла;
Возврат(ВыпускЗаДеньРасчётный);
КонецФункции 

&НаСервере
Функция ПолучитьВремяПростояПоЛинейкам(НаДату)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПростойЛинейки.Период,
	|	ПростойЛинейки.Окончание
	|ИЗ
	|	РегистрСведений.ПростойЛинейки КАК ПростойЛинейки
	|ГДЕ
	|	ПростойЛинейки.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|	И ПростойЛинейки.Период МЕЖДУ &ДатаНач И &ДатаКон";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(НаДату));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(НаДату));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
ВремяПростоя = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ВремяПростоя = ВремяПростоя + (ВыборкаДетальныеЗаписи.Окончание - ВыборкаДетальныеЗаписи.Период)/60;
	КонецЦикла;
Возврат(ВремяПростоя);
КонецФункции 

&НаСервере
Функция СформироватьНаСервере() 
ТабДок.Очистить();

Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблДата = Макет.ПолучитьОбласть("Дата");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.СписокЛинеек = СписокЛинеек;
ТабДок.Вывести(ОблШапка);

//Результат = ПолучитьОтставаниеПоЛинейкам(Отчет.Период.ДатаНачала);
//КолОтставание = Результат.Количество;
//КолОтставаниеУсл = Результат.КоличествоУсл;
	Если Отчет.ВидУсловногоКоэффициента = 1 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОстатки.Линейка КАК Линейка,
		|	ПланыВыпускаОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПланыВыпускаОстатки.КоличествоОстаток * ПланыВыпускаОстатки.Номенклатура.УсловныеПриборы КАК КоличествоОстатокУсл
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.Остатки(&НаДату, Линейка В ИЕРАРХИИ (&СписокЛинеек)) КАК ПланыВыпускаОстатки
		|ГДЕ
		|	ПланыВыпускаОстатки.МаршрутнаяКарта.Ремонт = ЛОЖЬ
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоОстатокУсл)
		|ПО
		|	Линейка";
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОстатки.Линейка КАК Линейка,
		|	ПланыВыпускаОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПланыВыпускаОстатки.КоличествоОстаток * ПланыВыпускаОстатки.Номенклатура.УсловныйКоэффициентПЭО КАК КоличествоОстатокУсл
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.Остатки(&НаДату, Линейка В ИЕРАРХИИ (&СписокЛинеек)) КАК ПланыВыпускаОстатки
		|ГДЕ
		|	ПланыВыпускаОстатки.МаршрутнаяКарта.Ремонт = ЛОЖЬ
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(КоличествоОстатокУсл)
		|ПО
		|	Линейка";
	КонецЕсли;	
Запрос.УстановитьПараметр("НаДату",КонецДня(Отчет.Период.ДатаНачала - 86400));
Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
Результат = Запрос.Выполнить();
ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КолОтставание = 0;
КолОтставаниеУсл = 0;
	Пока ВыборкаИтоги.Следующий() Цикл
	КолОтставание = КолОтставание + ВыборкаИтоги.КоличествоОстаток;	
	КолОтставаниеУсл = КолОтставаниеУсл + ВыборкаИтоги.КоличествоОстатокУсл;		
	КонецЦикла;
 
ОблДата.Параметры.Дата = Формат(Отчет.Период.ДатаНачала-86400,"ДФ=dd.MM.yyyy");
ОблДата.Параметры.КолЗагр = 0;
ОблДата.Параметры.КолЗагрУсл = 0;
ОблДата.Параметры.КолИзгот = 0;
ОблДата.Параметры.КолИзготУсл = 0;
ОблДата.Параметры.ПроцентВып = 0;
ОблДата.Параметры.КолОтставание = КолОтставание;
ОблДата.Параметры.КолОтставаниеУсл = КолОтставаниеУсл;
ТабДок.Вывести(ОблДата);

КолЗагрВсего = 0;
КолЗагрУслВсего = 0;
КолИзготВсего = 0;
КолИзготУслВсего = 0;
КолПланВсего = 0;
ПроцентВыпВсего = 0;
ВыбДата = НачалоДня(Отчет.Период.ДатаНачала);
	Пока ВыбДата <= НачалоДня(Отчет.Период.ДатаОкончания) Цикл
	Отбор = Новый Структура("ПроизводственныйКалендарь,Дата,Год",Константы.ОсновнойПроизводственныйКалендарь.Получить(),ВыбДата,Год(ВыбДата));
	Выборка = РегистрыСведений.ДанныеПроизводственногоКалендаря.Получить(Отбор);
		//Если Выборка.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
		//ВыбДата = ВыбДата + 86400;
		//Продолжить;
		//КонецЕсли; 
	Если Отчет.ВидУсловногоКоэффициента = 1 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК ПрихУсл
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
		|ГДЕ
		|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
		|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ
		|ИТОГИ
		|	СУММА(КоличествоПриход),
		|	СУММА(ПрихУсл)
		|ПО
		|	ОБЩИЕ";
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
		|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныйКоэффициентПЭО КАК ПрихУсл
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
		|ГДЕ
		|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
		|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ
		|ИТОГИ
		|	СУММА(КоличествоПриход),
		|	СУММА(ПрихУсл)
		|ПО
		|	ОБЩИЕ";
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ВыбДата));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ВыбДата));
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	Результат = Запрос.Выполнить();
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КолПриход = 0;
	ПрихУсл = 0;
		Пока ВыборкаИтоги.Следующий() Цикл
		КолПриход = ВыборкаИтоги.КоличествоПриход;	
		ПрихУсл = ВыборкаИтоги.ПрихУсл;		
		КонецЦикла;
			Если Отчет.ВидУсловногоКоэффициента = 1 Тогда		
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПланыВыпускаОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоНачальныйОстаток * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК НОУсл,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК РасхУсл,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныеПриборы КАК КОУсл
				|ИЗ
				|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
				|ГДЕ
				|	(ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|				И ПланыВыпускаОстаткиИОбороты.КоличествоРасход > 0
				|			ИЛИ ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Дата < &ДатаНач)
				|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
				|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ
				|ИТОГИ
				|	СУММА(КоличествоНачальныйОстаток),
				|	СУММА(КоличествоРасход),
				|	СУММА(КоличествоКонечныйОстаток),
				|	СУММА(НОУсл),
				|	СУММА(РасхУсл),
				|	СУММА(КОУсл)
				|ПО
				|	ОБЩИЕ"; 
			Иначе
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПланыВыпускаОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоНачальныйОстаток * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныйКоэффициентПЭО КАК НОУсл,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныйКоэффициентПЭО КАК РасхУсл,
				|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток * ПланыВыпускаОстаткиИОбороты.Номенклатура.УсловныйКоэффициентПЭО КАК КОУсл
				|ИЗ
				|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
				|ГДЕ
				|	(ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|				И ПланыВыпускаОстаткиИОбороты.КоличествоРасход > 0
				|			ИЛИ ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Дата < &ДатаНач)
				|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)
				|	И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ
				|ИТОГИ
				|	СУММА(КоличествоНачальныйОстаток),
				|	СУММА(КоличествоРасход),
				|	СУММА(КоличествоКонечныйОстаток),
				|	СУММА(НОУсл),
				|	СУММА(РасхУсл),
				|	СУММА(КОУсл)
				|ПО
				|	ОБЩИЕ"; 
 			КонецЕсли;
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ВыбДата));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ВыбДата));
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	Результат = Запрос.Выполнить();
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КолРасход = 0;
	КолРасходУсл = 0;
	КолПлан = 0;
	ПроцентВып = 0;
		Пока ВыборкаИтоги.Следующий() Цикл
		КолРасход = ВыборкаИтоги.КоличествоРасход;
		КолРасходУсл = ВыборкаИтоги.РасхУсл;
		КонецЦикла;
	ВыпускЗаДеньРасчётный = ПолучитьВыпускЗаДеньРасчётныйПоЛинейкам(ВыбДата); 
		Если КолОтставание + КолПриход < ВыпускЗаДеньРасчётный Тогда
		КолПлан = КолОтставание + КолПриход;
		Иначе
		КолПлан = ВыпускЗаДеньРасчётный;
		КонецЕсли;
			Если КолРасход > 0 Тогда
			КолПланВсего = КолПланВсего + КолПлан;
			КонецЕсли; 
	КолОтставание = КолОтставание + КолПриход - КолРасход;
	КолОтставаниеУсл = КолОтставаниеУсл + ПрихУсл - КолРасходУсл; 
	ВремяПростоя = ПолучитьВремяПростояПоЛинейкам(ВыбДата); 
	ПроцентВып = ?(КолПлан > 0,Окр(КолРасход/КолПлан*100,2,1),0); 
	ПроцентВыпВсего = ПроцентВыпВсего + ПроцентВып;		
	КолЗагрВсего = КолЗагрВсего + КолПриход;
	КолЗагрУслВсего = КолЗагрУслВсего + ПрихУсл;
	КолИзготВсего = КолИзготВсего + КолРасход;
	КолИзготУслВсего = КолИзготУслВсего + КолРасходУсл;
	ОблДата.Параметры.Дата = Формат(ВыбДата,"ДФ=dd.MM.yyyy");
	ОблДата.Параметры.КолЗагр = КолПриход;
	ОблДата.Параметры.КолЗагрУсл = ПрихУсл;
	ОблДата.Параметры.КолИзгот = КолРасход;
	ОблДата.Параметры.КолИзготУсл = КолРасходУсл;
	ОблДата.Параметры.КолПлан = КолПлан;
	ОблДата.Параметры.ПроцентВып = ПроцентВып;
	ОблДата.Параметры.КолОтставание = КолОтставание;
	ОблДата.Параметры.КолОтставаниеУсл = КолОтставаниеУсл;
	ТабДок.Вывести(ОблДата);
	ВыбДата = ВыбДата + 86400;
	КонецЦикла;
ОблКонец.Параметры.КолЗагрВсего = КолЗагрВсего;
ОблКонец.Параметры.КолЗагрУслВсего = КолЗагрУслВсего;
ОблКонец.Параметры.КолИзготВсего = КолИзготВсего;
ОблКонец.Параметры.КолИзготУслВсего = КолИзготУслВсего;
ОблКонец.Параметры.ПроцентВыпВсего = ?(КолПланВсего > 0,Окр(КолИзготВсего*100/КолПланВсего,2,1),0);
ОблКонец.Параметры.КолОтставаниеВсего = КолОтставание;
ОблКонец.Параметры.КолОтставаниеУслВсего = КолОтставаниеУсл;		
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 4;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура СохранитьОтставаниеНаСервере()
ОтставаниеОтПлана = РегистрыСведений.ОтставаниеОтПланаПроизводства.СоздатьМенеджерЗаписи();
ОтставаниеОтПлана.Период = Отчет.Период.ДатаОкончания+86400;
ОтставаниеОтПлана.Линейка = Отчет.Линейка;
ОтставаниеОтПлана.Количество = КолОтставание; 
ОтставаниеОтПлана.КоличествоУсл = КолОтставаниеУсл;
ОтставаниеОтПлана.Записать(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтставание(Команда)
СохранитьОтставаниеНаСервере();
КонецПроцедуры

&НаСервере
Функция НастройкиНаСервере()
Настройки = Новый Структура("СписокЛинеек",СписокЛинеек);
Возврат(Новый Структура("КлючНазначенияИспользования,Настройки","ОтчетПоВыполнениюПланаЛинеекСводныйПоДатам",Настройки));
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкиФорм",НастройкиНаСервере());
	Если Результат <> Неопределено Тогда	
	СписокЛинеек = Результат.СписокЛинеек;	
	КонецЕсли;
КонецПроцедуры
